# Одна з класичних задач на розуміння рекурсії — це ряд Фібоначчі.
# де кожне наступне число послідовності виходить додаванням двох попередніх членів ряду.

# У загальному вигляді для обчислення n-го члена ряду Фібоначчі слід обчислити вираз:
# Fn = Fn-1 + Fn-2.

# Це завдання можна вирішити рекурсивно, викликаючи функцію, що обчислює числа послідовності доти, 
# доки виклик не сягне членів ряду менше n = 1, на якій задана послідовність.


def fibonacci(n):
    if n <= 0:
        return 0
    if n == 1:
        return 1
    return fibonacci(n - 1) + fibonacci(n - 2)


def main(n):
    return fibonacci(n)


if __name__ == "__main__":
    print(main(5))
