# За допомогою колекції deque реалізуйте структуру даних FIFO. 
# Створіть змінну fifo, що містить колекцію deque. 
# Обмежте розмір за допомогою константи MAX_LEN. 
# Функція push додає значення element до кінця списку fifo. 
# Функція pop дістає та повертає перше значення зі списку fifo.


from collections import deque

MAX_LEN = 3

fifo = deque(maxlen=MAX_LEN)


def push(element):
    fifo.append(element)
    return fifo


def pop():
    first = fifo.popleft()
    return first
    

if __name__ == "__main__":
    for num in range(1, 10):
        push(num)
    pop()
    print(fifo)


# FIFO (англ. first in, first out - "першим прийшов - першим пішов") - 
# спосіб організації даних або іншими словами черга. 
# Цей вислів описує принцип технічної обробки черги чи обслуговування конфліктних вимог 
# шляхом впорядкування процесу за принципом: "першим прийшов - першим обслужений" (ПППО). 
# Той, хто приходить першим, той і обслуговується першим, хто прийде наступним чекає, 
# поки обслуговування першого не буде закінчено, і таке інше.
   