# Напишіть функцію flatten, яка приймає на вхід список,
# рекурсивно вирівнюватиме цей список і повертатиме пласку версію списку.

def flatten(data):
    if len(data) == 0:
        return []
    if isinstance(data[0], list):
        return flatten(data[0]) + flatten(data[1:])
    return data[:1] + flatten(data[1:])


if __name__ == "__main__":
    print(flatten([1, 2, [3, 4, [5, 6]], 7]))



# Рекурсія добре підходить до задачі flatentening. Це процес вирівнювання списків, який полягає в
# позбавленні вкладеної структури. Наприклад список вигляду [1, 2, [3, 4, [5, 6]], 7]
# має бути перетворений на плоский (flat) список [1, 2, 3, 4, 5, 6, 7]
#
# Напишіть функцію flatten, яка приймає на вхід список,
# рекурсивно вирівнюватиме цей список і повертатиме пласку версію списку.
#
# Для виконання завдання можна дотримуватися наступного алгоритму:
#
# Якщо вхідний список порожній, то:
#   Повертаємо порожній список
# Якщо перший елемент списку є списком, то:
#   Отримуємо перший список, рекурсивно викликавши функцію з першим елементом списку
#   Отримуємо другий список, рекурсивно викликавши функцію з рештою списку без першого елемента
#   Повертаємо конкатенацію двох списків
# Якщо перший елемент списку не є списком, то:
#   Отримуємо перший список із першого елемента списку
#   Отримуємо другий список, рекурсивно викликавши функцію з рештою списку без першого елемента
#   Повертаємо конкатенацію двох списків