# Напишіть функцію з ім'ям is_integer, яка розширюватиме функціональність isdigit().


def is_integer(s):
    if len(s) == 0:
        return False
    return s.strip().lstrip("+-").isdigit()


if __name__ == "__main__":
    print(is_integer(" +15 "))


# У Python існує рядкова функція isdigit(). Ця функція повертає True, якщо всі символи в рядку є цифрами,
# і є принаймні один символ, інакше — False. Напишіть функцію з ім'ям is_integer,
# яка розширюватиме функціональність isdigit(). При перевірці рядка необхідно ігнорувати початкові та кінцеві
# прогалини в рядку. Після виключення зайвих прогалин рядок вважається таким, що представляє ціле число, якщо:
#
# її довжина більша або дорівнює одному символу
# вона повністю складається з цифр
# передбачити виняток, що, можливо, є початковий знак "+" або "-", після якого мають йти цифри
