def capital_text(s):
    text = s.split()
    text[0] = text[0].capitalize()
    for idx in range(1, len(text)):
        if text[idx-1][-1] in (".", "?", "!"):
            text[idx] = text[idx].capitalize()
    return " ".join(text)


if __name__ == "__main__":
    print(capital_text("stop! what do you see? it's dog. don't worry"))


"""
Дуже часто люди у своїх повідомленнях не ставлять великі літери, 
особливо це стало масовим явищем в еру мобільних. пристроїв. 
Розробіть функцію capital_text, яка прийматиме на вхід рядок з текстом 
і повертатиме рядок з відновленими великими літерами.

Функція повинна:

    зробити великою першу літеру в рядку, попри прогалини
    зробити великою першу літеру після точки, попри прогалини
    зробити великою першу літеру після знака оклику, попри прогалини
    зробити великою першу літеру після знака питання, попри прогалини

"""