# Напишіть функцію data_preparation, яка приймає набір даних, список списків.

# Функція повинна видаляти з переданих списків найбільше і найменше значення, 
# але якщо розмір списку понад два елементи. Після видалення даних з кожного списку 
# необхідно злити їх разом в один список, відсортувати його за зменшенням та повернути 
# отриманий список як результат



def data_preparation(list_data):
    final_lst = []
    for lst in list_data:
        if len(lst) > 3:
            lst.remove(min(lst))
            lst.remove(max(lst))
        final_lst.extend(lst)
    final_lst.sort(reverse=True)
    return final_lst


if __name__ == "__main__":
    print(data_preparation([[1, 2, 3, 0], [3], [5, 6, 1, 7, 2]]))



# У четвертому модулі розв'язували завдання нормалізації даних. Розширмо її.
# При аналізі даних часто виникає необхідність позбавитися екстремальних значень, 
# перш ніж почати працювати з даними далі. Напишіть функцію data_preparation, 
# яка приймає набір даних, список списків (Приклад: [[1,2,3],[3,4], [5,6]]).

# Функція повинна видаляти з переданих списків найбільше і найменше значення, 
# але якщо розмір списку понад два елементи. Після видалення даних з кожного списку 
# необхідно злити їх разом в один список, відсортувати його за зменшенням та повернути 
# отриманий список як результат (Для прикладу вище результат буде наступним: [6, 5, 4, 3, 2]).