# Необхідно обчислити коріння квадратного рівняння.
# Детальні умови задачі - під кодом.

import math

a = int(input("Enter coefficient a: "))
b = int(input("Enter coefficient b: "))
c = int(input("Enter coefficient c: "))

D = b ** 2 - 4 * a * c

if D > 0:
    x1 = (-b + math.sqrt(D)) / (2 * a)
    x2 = (-b - math.sqrt(D)) / (2 * a)
    print(x1, x2)
    
elif D == 0:
    x = -b / (2 * a)
    print(x)
    
else:
    print("коренів немає")
    


# Необхідно обчислити коріння квадратного рівняння.
# a*x**2 + b*x + c = 0

# Дискримінант рівняння помістіть у змінну D
# D = b**2 - 4*a*c

# Коріння рівняння помістіть у змінні x1 та x2
# x1 = (-b + D**0.5) / (2*a)
# x2 = (-b - D**0.5) / (2*a)

# Минулого разу ми просто вказали значення коефіцієнтів a, b, c. 
# Тепер, коли ми вже знаємо про розгалуження, ми можемо перевіряти значення дискримінанта і, 
# в залежності від того додатне чи від'ємне, провести розрахунок коренів. 
# Виконайте розрахунок коренів для довільних значень коефіцієнтів a, b, c.