# Pозрахуйте найбільший спільний дільник (НД) двох додатних чисел. 
# НСД — це найбільше число, яке без залишку діляться на обидва числа.
# Детальні умови задачі - див під кодом.


first = int(input("Enter the first integer: "))
second = int(input("Enter the second integer: "))

gcd = first if first < second else second
while True:
    if first % gcd != 0:
        gcd -= 1
    elif (first % gcd == 0) and (second % gcd != 0):
        gcd -= 1
    else:
        break

print(gcd)



# Є кілька алгоритмів знаходження НСД, але ми розберемо циклічний алгоритм.

# 1, Хай є два початкових числа first та second.
# 2. Виберемо менше з них та привласнимо значення змінній gcd.
# 3. Поки first або second не діляться на gcd без залишку, треба виконувати цикл, в якому зменшуємо змінну gcd на одиницю.
# 4. Коли цикл закінчиться в змінній gcd буде НСД для чисел first та second.

# Напишіть програму, яка для двох додатних цілих чисел знаходить НСД.

# Примітка: 
# Для умови циклу в пункті 3 необхідно пам'ятати, що цикл while виконується за умови True, 
# а наш цикл повинен закінчитися, тільки якщо gcd поділив обидва числа без залишку.