# Напишіть два цикли, вкладені один в один. 

# У першому циклі while ми постійно запитуємо ціле число, 
# а у другому з допомогою циклу for складаємо суму чисел від 0 до введеного числа включно і додаємо до змінної sum. 
# Змінна sum накопичує суми, що утворюються при кожному введенні числа. 

# Вихід з першого циклу здійснюємо, якщо ми ввели число 0.



num = int(input("Enter integer (0 for output): "))
sum = 0

while num != 0:
    for i in range(num+1):
        sum += i
    num = int(input("Enter integer (0 for output): "))

print(sum)
